
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>主键索引和唯一索引的区别 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="mysql最左索引前缀匹配为什么要这么设计.html" />
    
    
    <link rel="prev" href="去重时distinct和group的区别.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    cloud
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../cloud/rpc/rpc框架是短连接还是长连接.html">
            
                <a href="../cloud/rpc/rpc框架是短连接还是长连接.html">
            
                    
                    rpc框架是短连接还是长连接
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="2.1" >
            
                <span>
            
                    
                    java
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.1.1" data-path="../java/动态代理的类和原始类的关系.html">
            
                <a href="../java/动态代理的类和原始类的关系.html">
            
                    
                    动态代理的类和原始类的关系
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="2.2" >
            
                <span>
            
                    
                    mysql
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.2.1" data-path="去重时distinct和group的区别.html">
            
                <a href="去重时distinct和group的区别.html">
            
                    
                    去重时distinct和group的区别
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="2.2.2" data-path="主键索引和唯一索引的区别.html">
            
                <a href="主键索引和唯一索引的区别.html">
            
                    
                    主键索引和唯一索引的区别
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2.3" data-path="mysql最左索引前缀匹配为什么要这么设计.html">
            
                <a href="mysql最左索引前缀匹配为什么要这么设计.html">
            
                    
                    mysql最左索引前缀匹配为什么要这么设计
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="2.3" >
            
                <span>
            
                    
                    mybatis
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.3.1" data-path="../mybatis/mapper接口和xml底层的转换原理.html">
            
                <a href="../mybatis/mapper接口和xml底层的转换原理.html">
            
                    
                    mapper接口和xml底层的转换原理
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="2.4" >
            
                <span>
            
                    
                    redis
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.4.1" data-path="../redis/redis基本数据类型及底层数据结构.html">
            
                <a href="../redis/redis基本数据类型及底层数据结构.html">
            
                    
                    redis基本数据类型及底层数据结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.4.2" data-path="../redis/RDB和AOF.html">
            
                <a href="../redis/RDB和AOF.html">
            
                    
                    RDB和AOF
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >主键索引和唯一索引的区别</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x4E3B;&#x952E;&#x7D22;&#x5F15;&#x548C;&#x552F;&#x4E00;&#x7D22;&#x5F15;&#x7684;&#x533A;&#x522B;">&#x4E3B;&#x952E;&#x7D22;&#x5F15;&#x548C;&#x552F;&#x4E00;&#x7D22;&#x5F15;&#x7684;&#x533A;&#x522B;</h1>
<h2 id="&#x4EC0;&#x4E48;&#x662F;&#x4E3B;&#x952E;&#x7D22;&#x5F15;">&#x4EC0;&#x4E48;&#x662F;&#x4E3B;&#x952E;&#x7D22;&#x5F15;</h2>
<p>&#x4E3B;&#x952E;&#x7D22;&#x5F15;&#x662F;&#x6570;&#x636E;&#x5E93;&#x8868;&#x4E2D;&#x7684;&#x4E00;&#x79CD;&#x7D22;&#x5F15;&#x7C7B;&#x578B;&#xFF0C;&#x7528;&#x4E8E;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x8868;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x884C;&#x6570;&#x636E;&#x3002;&#x5728;&#x4E3B;&#x952E;&#x7D22;&#x5F15;&#x4E2D;&#xFF0C;&#x7D22;&#x5F15;&#x5217;&#x7684;&#x503C;&#x5FC5;&#x987B;&#x662F;&#x552F;&#x4E00;&#x7684;&#x4E14;&#x4E0D;&#x4E3A;&#x7A7A;&#xFF0C;&#x901A;&#x5E38;&#x7528;&#x6765;&#x52A0;&#x901F;&#x5BF9;&#x8868;&#x4E2D;&#x6570;&#x636E;&#x7684;&#x68C0;&#x7D22;&#x548C;&#x67E5;&#x8BE2;&#x64CD;&#x4F5C;&#x3002;</p>
<ol>
<li>&#x552F;&#x4E00;&#x6027;&#xFF1A;&#x4E3B;&#x952E;&#x7D22;&#x5F15;&#x8981;&#x6C42;&#x7D22;&#x5F15;&#x5217;&#x7684;&#x503C;&#x5728;&#x6574;&#x4E2A;&#x8868;&#x4E2D;&#x662F;&#x552F;&#x4E00;&#x7684;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6BCF;&#x4E00;&#x884C;&#x6570;&#x636E;&#x90FD;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E3B;&#x952E;&#x7D22;&#x5F15;&#x8FDB;&#x884C;&#x7CBE;&#x786E;&#x7684;&#x67E5;&#x627E;&#x548C;&#x5B9A;&#x4F4D;&#x3002;</li>
<li>&#x5FC5;&#x987B;&#x975E;&#x7A7A;&#xFF1A;&#x4E3B;&#x952E;&#x7D22;&#x5F15;&#x7684;&#x5217;&#x503C;&#x4E0D;&#x80FD;&#x4E3A;&#x7A7A;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x7528;&#x6765;&#x6807;&#x8BC6;&#x6BCF;&#x4E00;&#x884C;&#x6570;&#x636E;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x80FD;&#x4E3A;&#x7A7A;&#x503C;&#x4F1A;&#x8FDD;&#x53CD;&#x552F;&#x4E00;&#x6027;&#x7EA6;&#x675F;&#x3002;</li>
<li>&#x5FEB;&#x901F;&#x68C0;&#x7D22;&#xFF1A;&#x7531;&#x4E8E;&#x4E3B;&#x952E;&#x7D22;&#x5F15;&#x8981;&#x6C42;&#x503C;&#x7684;&#x552F;&#x4E00;&#x6027;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x4F1A;&#x5BF9;&#x4E3B;&#x952E;&#x7D22;&#x5F15;&#x8FDB;&#x884C;&#x9AD8;&#x6548;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7EC4;&#x7EC7;&#xFF0C;&#x901A;&#x5E38;&#x4F7F;&#x7528; B+ &#x6811;&#x7B49;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x4EE5;&#x4FBF;&#x5FEB;&#x901F;&#x5730;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x68C0;&#x7D22;&#x548C;&#x67E5;&#x8BE2;&#x64CD;&#x4F5C;&#x3002;</li>
<li>&#x9ED8;&#x8BA4;&#x805A;&#x7C07;&#x7D22;&#x5F15;&#xFF1A;&#x5728;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x4E3B;&#x952E;&#x7D22;&#x5F15;&#x901A;&#x5E38;&#x4E5F;&#x4F1A;&#x88AB;&#x7528;&#x4F5C;&#x8868;&#x7684;&#x805A;&#x7C07;&#x7D22;&#x5F15;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x5728;&#x4E3B;&#x952E;&#x7D22;&#x5F15;&#x7684;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x4E0A;&#xFF0C;&#x53EF;&#x4EE5;&#x52A0;&#x901F;&#x6309;&#x4E3B;&#x952E;&#x7684;&#x8303;&#x56F4;&#x626B;&#x63CF;&#x548C;&#x8FDE;&#x63A5;&#x64CD;&#x4F5C;&#x3002;</li>
</ol>
<h2 id="&#x4EC0;&#x4E48;&#x662F;&#x552F;&#x4E00;&#x7D22;&#x5F15;">&#x4EC0;&#x4E48;&#x662F;&#x552F;&#x4E00;&#x7D22;&#x5F15;</h2>
<p>&#x552F;&#x4E00;&#x7D22;&#x5F15;&#x662F;&#x6570;&#x636E;&#x5E93;&#x8868;&#x4E2D;&#x4E00;&#x79CD;&#x7D22;&#x5F15;&#x7C7B;&#x578B;&#xFF0C;&#x7528;&#x4E8E;&#x786E;&#x4FDD;&#x7D22;&#x5F15;&#x5217;&#x4E2D;&#x7684;&#x6570;&#x503C;&#x6216;&#x8005;&#x5B57;&#x7B26;&#x4E32;&#x662F;&#x552F;&#x4E00;&#x7684;&#xFF0C;&#x5373;&#x4E0D;&#x5141;&#x8BB8;&#x91CD;&#x590D;&#x503C;&#x5B58;&#x5728;&#x3002;&#x4E0E;&#x4E3B;&#x952E;&#x7D22;&#x5F15;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;&#x552F;&#x4E00;&#x7D22;&#x5F15;&#x5141;&#x8BB8;&#x7A7A;&#x503C;&#xFF08;NULL &#x503C;&#xFF09;&#xFF0C;&#x4F46;&#x8981;&#x6C42;&#x975E;&#x7A7A;&#x7684;&#x503C;&#x5728;&#x7D22;&#x5F15;&#x5217;&#x4E2D;&#x5FC5;&#x987B;&#x662F;&#x552F;&#x4E00;&#x7684;&#x3002;</p>
<ol>
<li>&#x786E;&#x4FDD;&#x552F;&#x4E00;&#x6027;&#xFF1A;&#x552F;&#x4E00;&#x7D22;&#x5F15;&#x53EF;&#x4EE5;&#x786E;&#x4FDD;&#x7D22;&#x5F15;&#x5217;&#x4E2D;&#x7684;&#x503C;&#x662F;&#x552F;&#x4E00;&#x7684;&#xFF0C;&#x4E0D;&#x5141;&#x8BB8;&#x51FA;&#x73B0;&#x91CD;&#x590D;&#x503C;&#x3002;&#x8FD9;&#x6709;&#x52A9;&#x4E8E;&#x7EF4;&#x62A4;&#x6570;&#x636E;&#x7684;&#x5B8C;&#x6574;&#x6027;&#x548C;&#x51C6;&#x786E;&#x6027;&#x3002;</li>
<li>&#x5141;&#x8BB8;&#x7A7A;&#x503C;&#xFF1A;&#x4E0E;&#x4E3B;&#x952E;&#x7D22;&#x5F15;&#x4E0D;&#x540C;&#xFF0C;&#x552F;&#x4E00;&#x7D22;&#x5F15;&#x5141;&#x8BB8;&#x7D22;&#x5F15;&#x5217;&#x4E2D;&#x7684;&#x503C;&#x51FA;&#x73B0;&#x7A7A;&#x503C;&#xFF08;NULL&#xFF09;&#xFF0C;&#x53EA;&#x8981;&#x975E;&#x7A7A;&#x503C;&#x662F;&#x552F;&#x4E00;&#x7684;&#x5373;&#x53EF;&#x3002;</li>
<li>&#x63D0;&#x9AD8;&#x68C0;&#x7D22;&#x6548;&#x7387;&#xFF1A;&#x552F;&#x4E00;&#x7D22;&#x5F15;&#x53EF;&#x4EE5;&#x52A0;&#x901F;&#x5BF9;&#x8868;&#x4E2D;&#x6570;&#x636E;&#x7684;&#x68C0;&#x7D22;&#x548C;&#x67E5;&#x8BE2;&#x64CD;&#x4F5C;&#xFF0C;&#x56E0;&#x4E3A;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x4F1A;&#x4F7F;&#x7528;&#x7C7B;&#x4F3C;&#x4E8E; B+ &#x6811;&#x7B49;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x6765;&#x7EC4;&#x7EC7;&#x552F;&#x4E00;&#x7D22;&#x5F15;&#xFF0C;&#x4EE5;&#x4FBF;&#x5FEB;&#x901F;&#x67E5;&#x627E;&#x6570;&#x636E;&#x3002;</li>
</ol>
<h2 id="&#x805A;&#x7C07;&#x7D22;&#x5F15;&#x548C;&#x975E;&#x805A;&#x7C07;&#x7D22;&#x5F15;&#x7684;&#x533A;&#x522B;">&#x805A;&#x7C07;&#x7D22;&#x5F15;&#x548C;&#x975E;&#x805A;&#x7C07;&#x7D22;&#x5F15;&#x7684;&#x533A;&#x522B;</h2>
<p>&#x805A;&#x7C07;&#x7D22;&#x5F15;&#x548C;&#x975E;&#x805A;&#x7C07;&#x7D22;&#x5F15;&#x662F;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x7D22;&#x5F15;&#x7ED3;&#x6784;&#xFF0C;&#x5B83;&#x4EEC;&#x5728;&#x7D22;&#x5F15;&#x6570;&#x636E;&#x7684;&#x5B58;&#x50A8;&#x65B9;&#x5F0F;&#x548C;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x4E0A;&#x6709;&#x6240;&#x533A;&#x522B;&#x3002;</p>
<ol>
<li><strong>&#x805A;&#x7C07;&#x7D22;&#x5F15;</strong>&#xFF1A;<ul>
<li>&#x805A;&#x7C07;&#x7D22;&#x5F15;&#x6307;&#x7684;&#x662F;&#x5C06;&#x7D22;&#x5F15;&#x952E;&#x503C;&#x548C;&#x6570;&#x636E;&#x884C;&#x5B58;&#x50A8;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x7D22;&#x5F15;&#x7ED3;&#x6784;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x805A;&#x7C07;&#x7D22;&#x5F15;&#x51B3;&#x5B9A;&#x4E86;&#x8868;&#x4E2D;&#x6570;&#x636E;&#x884C;&#x7684;&#x7269;&#x7406;&#x6392;&#x5E8F;&#x65B9;&#x5F0F;&#x3002;</li>
<li>&#x8868;&#x4E2D;&#x53EA;&#x80FD;&#x6709;&#x4E00;&#x4E2A;&#x805A;&#x7C07;&#x7D22;&#x5F15;&#xFF0C;&#x56E0;&#x4E3A;&#x6570;&#x636E;&#x884C;&#x53EA;&#x80FD;&#x6309;&#x7167;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x6765;&#x6392;&#x5E8F;&#x5B58;&#x50A8;&#x3002;</li>
<li>&#x805A;&#x7C07;&#x7D22;&#x5F15;&#x7684;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x5305;&#x542B;&#x4E86;&#x5B9E;&#x9645;&#x7684;&#x6570;&#x636E;&#x884C;&#xFF0C;&#x56E0;&#x6B64;&#x901A;&#x8FC7;&#x805A;&#x7C07;&#x7D22;&#x5F15;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5B9A;&#x4F4D;&#x5230;&#x6570;&#x636E;&#x884C;&#xFF0C;&#x52A0;&#x5FEB;&#x6570;&#x636E;&#x68C0;&#x7D22;&#x7684;&#x901F;&#x5EA6;&#x3002;</li>
<li>&#x805A;&#x7C07;&#x7D22;&#x5F15;&#x901A;&#x5E38;&#x7528;&#x4E8E;&#x4E3B;&#x952E;&#x7D22;&#x5F15;&#xFF0C;&#x56E0;&#x4E3A;&#x4E3B;&#x952E;&#x8981;&#x6C42;&#x552F;&#x4E00;&#x6027;&#x4E14;&#x975E;&#x7A7A;&#xFF0C;&#x9002;&#x5408;&#x4F5C;&#x4E3A;&#x6570;&#x636E;&#x884C;&#x7684;&#x7269;&#x7406;&#x6392;&#x5E8F;&#x65B9;&#x5F0F;&#x3002;</li>
</ul>
</li>
<li><strong>&#x975E;&#x805A;&#x7C07;&#x7D22;&#x5F15;</strong>&#xFF1A;<ul>
<li>&#x975E;&#x805A;&#x7C07;&#x7D22;&#x5F15;&#x6307;&#x7684;&#x662F;&#x5C06;&#x7D22;&#x5F15;&#x952E;&#x503C;&#x548C;&#x6307;&#x5411;&#x6570;&#x636E;&#x884C;&#x7684;&#x6307;&#x9488;&#x5206;&#x5F00;&#x5B58;&#x50A8;&#x7684;&#x7D22;&#x5F15;&#x7ED3;&#x6784;&#x3002;&#x7D22;&#x5F15;&#x952E;&#x503C;&#x5B58;&#x50A8;&#x5728;&#x7D22;&#x5F15;&#x6811;&#x4E2D;&#xFF0C;&#x800C;&#x6570;&#x636E;&#x884C;&#x5B58;&#x50A8;&#x5728;&#x8868;&#x7684;&#x6570;&#x636E;&#x9875;&#x4E2D;&#x3002;</li>
<li>&#x8868;&#x4E2D;&#x53EF;&#x4EE5;&#x6709;&#x591A;&#x4E2A;&#x975E;&#x805A;&#x7C07;&#x7D22;&#x5F15;&#xFF0C;&#x56E0;&#x4E3A;&#x7D22;&#x5F15;&#x952E;&#x503C;&#x548C;&#x6570;&#x636E;&#x884C;&#x7684;&#x5B58;&#x50A8;&#x662F;&#x5206;&#x5F00;&#x7684;&#x3002;</li>
<li>&#x975E;&#x805A;&#x7C07;&#x7D22;&#x5F15;&#x7684;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x4E0D;&#x5305;&#x542B;&#x5B9E;&#x9645;&#x7684;&#x6570;&#x636E;&#x884C;&#xFF0C;&#x800C;&#x662F;&#x5305;&#x542B;&#x6307;&#x5411;&#x6570;&#x636E;&#x884C;&#x7684;&#x6307;&#x9488;&#xFF0C;&#x9700;&#x8981;&#x5148;&#x901A;&#x8FC7;&#x7D22;&#x5F15;&#x627E;&#x5230;&#x5BF9;&#x5E94;&#x7684;&#x6570;&#x636E;&#x884C;&#x3002;</li>
<li>&#x975E;&#x805A;&#x7C07;&#x7D22;&#x5F15;&#x9002;&#x5408;&#x7528;&#x4E8E;&#x9700;&#x8981;&#x9891;&#x7E41;&#x8FDB;&#x884C;&#x8303;&#x56F4;&#x67E5;&#x8BE2;&#x6216;&#x8005;&#x4E0D;&#x552F;&#x4E00;&#x7D22;&#x5F15;&#x7684;&#x5217;&#x3002;</li>
</ul>
</li>
</ol>
<h2 id="mysql&#x4E2D;&#x6709;&#x975E;&#x805A;&#x7C07;&#x7D22;&#x5F15;&#x5417;">mysql&#x4E2D;&#x6709;&#x975E;&#x805A;&#x7C07;&#x7D22;&#x5F15;&#x5417;</h2>
<p>MySQL &#x4E2D;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x7D22;&#x5F15;&#x90FD;&#x662F;&#x975E;&#x805A;&#x7C07;&#x7D22;&#x5F15;&#x3002;MySQL &#x4E2D;&#x7684;&#x7D22;&#x5F15;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x901A;&#x8FC7; B+ &#x6811;&#x6216;&#x8005;&#x54C8;&#x5E0C;&#x7B49;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x6765;&#x7EC4;&#x7EC7;&#x548C;&#x5B58;&#x50A8;&#x7D22;&#x5F15;&#x952E;&#x503C;&#xFF0C;&#x800C;&#x6570;&#x636E;&#x884C;&#x5219;&#x662F;&#x5355;&#x72EC;&#x5B58;&#x50A8;&#x5728;&#x8868;&#x7684;&#x6570;&#x636E;&#x9875;&#x4E2D;&#x7684;&#x3002;&#x56E0;&#x6B64;&#xFF0C;MySQL &#x4E2D;&#x7684;&#x7D22;&#x5F15;&#x4E0D;&#x4F1A;&#x76F4;&#x63A5;&#x5305;&#x542B;&#x5B9E;&#x9645;&#x7684;&#x6570;&#x636E;&#x884C;&#xFF0C;&#x800C;&#x662F;&#x5B58;&#x50A8;&#x6307;&#x5411;&#x6570;&#x636E;&#x884C;&#x7684;&#x5F15;&#x7528;&#x6216;&#x6307;&#x9488;&#x3002;</p>
<p>&#x5F53;&#x4F60;&#x5728; MySQL &#x4E2D;&#x521B;&#x5EFA;&#x7D22;&#x5F15;&#x65F6;&#xFF08;&#x5982;&#x666E;&#x901A;&#x7D22;&#x5F15;&#x3001;&#x552F;&#x4E00;&#x7D22;&#x5F15;&#x3001;&#x5168;&#x6587;&#x7D22;&#x5F15;&#x7B49;&#xFF09;&#xFF0C;&#x8FD9;&#x4E9B;&#x7D22;&#x5F15;&#x90FD;&#x5C5E;&#x4E8E;&#x975E;&#x805A;&#x7C07;&#x7D22;&#x5F15;&#x7684;&#x8303;&#x7574;&#x3002;&#x975E;&#x805A;&#x7C07;&#x7D22;&#x5F15;&#x5728; MySQL &#x4E2D;&#x662F;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x7D22;&#x5F15;&#x7C7B;&#x578B;&#xFF0C;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x52A0;&#x901F;&#x6570;&#x636E;&#x7684;&#x68C0;&#x7D22;&#x548C;&#x67E5;&#x8BE2;&#x64CD;&#x4F5C;&#xFF0C;&#x63D0;&#x9AD8;&#x6570;&#x636E;&#x5E93;&#x7684;&#x6027;&#x80FD;&#x3002;</p>
<p><strong>&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x6BD4;&#x5982; MyISAM&#xFF0C;&#x5219;&#x4E3B;&#x952E;&#x7D22;&#x5F15;&#x5E76;&#x4E0D;&#x662F;&#x805A;&#x7C07;&#x7D22;&#x5F15;&#xFF0C;&#x800C;&#x662F;&#x4F7F;&#x7528;&#x5355;&#x72EC;&#x7684;&#x7D22;&#x5F15;&#x7ED3;&#x6784;&#x6765;&#x7BA1;&#x7406;&#x4E3B;&#x952E;&#x3002;</strong></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="去重时distinct和group的区别.html" class="navigation navigation-prev " aria-label="Previous page: 去重时distinct和group的区别">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="mysql最左索引前缀匹配为什么要这么设计.html" class="navigation navigation-next " aria-label="Next page: mysql最左索引前缀匹配为什么要这么设计">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"主键索引和唯一索引的区别","level":"2.2.2","depth":2,"next":{"title":"mysql最左索引前缀匹配为什么要这么设计","level":"2.2.3","depth":2,"path":"mysql/mysql最左索引前缀匹配为什么要这么设计.md","ref":"mysql/mysql最左索引前缀匹配为什么要这么设计.md","articles":[]},"previous":{"title":"去重时distinct和group的区别","level":"2.2.1","depth":2,"path":"mysql/去重时distinct和group的区别.md","ref":"mysql/去重时distinct和group的区别.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"mysql/主键索引和唯一索引的区别.md","mtime":"2024-04-01T08:34:52.820Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2024-04-03T08:03:54.989Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

