
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>2024-04-26-我和我的惰性思维 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="2024-05-14-选择的差异性.html" />
    
    
    <link rel="prev" href="2024-04-01-我也是乘上了金三的尾巴.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="2024-03-19-沉冤昭雪.html">
            
                <a href="2024-03-19-沉冤昭雪.html">
            
                    
                    2024-03-19-沉冤昭雪
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="2024-03-24-我为自己找的借口.html">
            
                <a href="2024-03-24-我为自己找的借口.html">
            
                    
                    2024-03-24-我为自己找的借口
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="2024-04-01-我也是乘上了金三的尾巴.html">
            
                <a href="2024-04-01-我也是乘上了金三的尾巴.html">
            
                    
                    2024-04-01-我也是乘上了金三的尾巴
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.5" data-path="2024-04-26-我和我的惰性思维.html">
            
                <a href="2024-04-26-我和我的惰性思维.html">
            
                    
                    2024-04-26-我和我的惰性思维
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="2024-05-14-选择的差异性.html">
            
                <a href="2024-05-14-选择的差异性.html">
            
                    
                    2024-05-14-选择的差异性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="2024-06-10-毕业是诀别么.html">
            
                <a href="2024-06-10-毕业是诀别么.html">
            
                    
                    2024-06-10-毕业是诀别么
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="2024-08-03-原来我还是没有放弃自己的童真.html">
            
                <a href="2024-08-03-原来我还是没有放弃自己的童真.html">
            
                    
                    2024-08-03-原来我还是没有放弃自己的童真
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >2024-04-26-我和我的惰性思维</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x6211;&#x548C;&#x6211;&#x7684;&#x60F0;&#x6027;&#x601D;&#x7EF4;">&#x6211;&#x548C;&#x6211;&#x7684;&#x60F0;&#x6027;&#x601D;&#x7EF4;</h1>
<p>&#x8DDD;&#x79BB;&#x4E0A;&#x4E00;&#x6B21;&#x603B;&#x7ED3;&#x5927;&#x6982;&#x662F;&#x4E00;&#x4E2A;&#x6708;&#x4E86;&#xFF0C;&#x8FD9;&#x6B21;&#x81EA;&#x7701;&#x7684;&#x4E3B;&#x9898;&#x662F;&#x6211;&#x548C;&#x6211;&#x7684;&#x60F0;&#x6027;&#x601D;&#x7EF4;&#xFF0C;&#x90A3;&#x4E48;&#x4EC0;&#x4E48;&#x662F;&#x60F0;&#x6027;&#x601D;&#x7EF4;&#x5462;&#x1F928;&#x1F928;&#x1F928;&#xFF1F;</p>
<p><strong>&#x60F0;&#x6027;&#x601D;&#x7EF4;&#x662F;&#x6307;&#x4EBA;&#x7C7B;&#x601D;&#x7EF4;&#x6DF1;&#x5904;&#x5B58;&#x5728;&#x7684;&#x4E00;&#x79CD;&#x4FDD;&#x5B88;&#x529B;&#x91CF;&#xFF0C;&#x603B;&#x662F;&#x4E60;&#x60EF;&#x7528;&#x8001;&#x773C;&#x5149;&#x6765;&#x770B;&#x5F85;&#x65B0;&#x95EE;&#x9898;&#xFF0C;&#x7528;&#x66FE;&#x7ECF;&#x88AB;&#x53CD;&#x590D;&#x8BC1;&#x660E;&#x6709;&#x6548;&#x7684;&#x65E7;&#x89C2;&#x5FF5;&#x53BB;&#x89E3;&#x91CA;&#x53D8;&#x5316;&#x4E16;&#x754C;&#x7684;&#x65B0;&#x73B0;&#x8C61;&#x3002;</strong></p>
<p><img src="../images/wallhaven-zyjyjo.png" alt=""></p>
<h2 id="p1-&#x601D;&#x8003;">P1 &#x601D;&#x8003;</h2>
<p>&#x4E0A;&#x9762;&#x52A0;&#x7C97;&#x7684;&#x4E00;&#x6BB5;&#x8BDD;&#x6709;&#x51E0;&#x4E2A;&#x5173;&#x952E;&#x8BCD;&#x53EF;&#x5708;&#x53EF;&#x70B9;&#xFF0C;&#x4F8B;&#x5982;<strong>&#x8001;&#x773C;&#x5149;</strong>&#x3001;<strong>&#x65B0;&#x95EE;&#x9898;</strong>&#x3001;<strong>&#x6709;&#x6548;&#x7684;&#x65E7;&#x89C2;&#x5FF5;</strong>&#x548C;<strong>&#x53D8;&#x5316;&#x7684;&#x4E16;&#x754C;</strong>&#x7B49;&#x3002;</p>
<p><strong>&#x8001;&#x773C;&#x5149;</strong>&#xFF0C;&#x5BF9;&#x4E8E;&#x6211;&#x800C;&#x8A00;&#x4EC0;&#x4E48;&#x662F;&#x8001;&#x7684;&#x773C;&#x5149;&#xFF0C;&#x9996;&#x5148;&#x4ECE;&#x5B66;&#x4E60;&#x65B9;&#x9762;&#x8C08;&#x8D77;&#xFF0C;&#x1F310;&#x6211;&#x4E4B;&#x524D;&#x4EE5;&#x4E3A;&#x5B66;&#x4E60;&#x6280;&#x672F;&#x7684;&#x8FC7;&#x7A0B;&#x662F;&#x4E00;&#x4E2A;&#x5177;&#x6709;&#x56FA;&#x5B9A;&#x901A;&#x7528;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x6BD4;&#x5982;&#x57FA;&#x7840;-&gt;&#x719F;&#x7EC3;&#x4F7F;&#x7528;&#x57FA;&#x7840;-&gt;&#x9AD8;&#x7EA7;&#x7279;&#x6027;-&gt;&#x5B66;&#x4E60;&#x5F00;&#x6E90;&#x9879;&#x76EE;-&gt;&#x8FDB;&#x884C;&#x6307;&#x5B9A;&#x7279;&#x6027;&#x7684;&#x521B;&#x65B0;&#x3002;&#x4EE5;&#x4E0A;&#x4FBF;&#x662F;&#x6211;&#x7684;&#x60F0;&#x6027;&#x601D;&#x7EF4;&#xFF0C;&#x6211;&#x5FFD;&#x7565;&#x4E86;&#x5B66;&#x4E60;&#x4E2D;&#x7684;&#x53EF;&#x53D8;&#x6027;&#xFF0C;&#x5982;&#x5BF9;&#x4E8E;<strong>&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x7684;&#x719F;&#x7EC3;&#x7A0B;&#x5EA6;</strong>&#x3001;&#x5BF9;&#x4E8E;<strong>&#x9AD8;&#x7EA7;&#x7279;&#x6027;&#x7684;&#x5177;&#x4F53;&#x4F7F;&#x7528;&#x65B9;&#x6CD5;</strong>&#x7B49;&#x7B49;&#xFF0C;&#x4F8B;&#x5982;<em>&#x4E00;&#x4E9B;&#x65B9;&#x6CD5;&#x8BBE;&#x8BA1;&#x7684;&#x601D;&#x60F3;&#xFF0C;&#x5982;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5982;&#x679C;&#x9700;&#x8981;&#x6267;&#x884C;&#x4E00;&#x4E2A;&#x5176;&#x4ED6;&#x7684;&#x7EBF;&#x7A0B;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x9700;&#x8981;&#x5728;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x5185;&#x90E8;&#x53EF;&#x4EE5;&#x5F97;&#x77E5;&#x542F;&#x52A8;&#x7684;&#x7EBF;&#x7A0B;&#x7684;&#x72B6;&#x6001;</em>&#xFF0C;&#x4E0D;&#x7136;&#x4F1A;&#x9020;&#x6210;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#xFF0C;&#x56E0;&#x6B64;&#x5177;&#x4F53;&#x7684;&#x6267;&#x884C;&#x5468;&#x671F;&#x5E94;&#x8BE5;&#x662F;&#x7531;&#x53D1;&#x8D77;&#x7EBF;&#x7A0B;&#x8FDB;&#x884C;&#x63A7;&#x5236;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x5B8C;&#x5168;&#x7684;&#x7BA1;&#x63A7;&#x5E94;&#x7528;&#x7684;&#x6240;&#x6709;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x3002;</p>
<p>&#x4E0A;&#x8FF0;&#x662F;&#x5728;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x65F6;&#x53C2;&#x609F;&#x7684;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x4E5F;&#x662F;&#x5BF9;&#x5E94;&#x4E86;&#x4E24;&#x79CD;&#x89E3;&#x51B3;&#x65B9;&#x6848;</p>
<ol>
<li>&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x4F7F;&#x7528;&#x7684;&#x6B21;&#x6570;&#x548C;&#x7EC4;&#x7EC7;&#x5316;&#x8BB0;&#x5FC6;&#x6765;&#x8FDB;&#x884C;&#x63D0;&#x5347;&#xFF0C;&#x8FD9;&#x4E2A;&#x76F8;&#x5BF9;&#x4E8E;&#x53E6;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x76F8;&#x5BF9;&#x6765;&#x8BF4;&#x66F4;&#x5BB9;&#x6613;&#x63D0;&#x5347;&#x3002;</li>
<li>&#x9AD8;&#x7EA7;&#x7279;&#x6027;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x9605;&#x8BFB;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x601D;&#x60F3;&#x7684;&#x4E66;&#x7C4D;&#x6765;&#x8FDB;&#x884C;&#x63D0;&#x5347;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x89C2;&#x5BDF;&#x5F00;&#x6E90;&#x4EE3;&#x7801;&#x7684;&#x65B9;&#x5F0F;&#x501F;&#x9274;&#x4ED6;&#x4EBA;&#x7684;&#x7528;&#x6CD5;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#x3002;</li>
</ol>
<p><strong>&#x65B0;&#x95EE;&#x9898;</strong>&#xFF0C;&#x65B0;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x8FD1;&#x671F;&#x9047;&#x5230;&#x7684;&#x65B0;&#x7684;&#x95EE;&#x9898;&#x5982;&#xFF1A;&#x8D28;&#x7591;AI&#x4F1A;&#x53D6;&#x4EE3;&#x7A0B;&#x5E8F;&#x5458;&#xFF1B;&#x8D28;&#x7591;&#x540E;&#x7AEF;&#x5F00;&#x53D1;&#x7684;&#x4E0A;&#x4E0B;&#x9650;&#xFF1B;&#x8D28;&#x7591;&#x81EA;&#x5DF1;&#x7684;&#x80FD;&#x529B;&#x7B49;&#x3002;&#x9047;&#x5230;&#x8D28;&#x7591;&#x65E0;&#x6CD5;&#x81EA;&#x5DF1;&#x53BB;&#x67E5;&#x9605;&#x8D44;&#x6599;&#x89E3;&#x51B3;&#xFF0C;&#x9020;&#x6210;&#x4E86;&#x4EBA;&#x4E91;&#x4EA6;&#x4E91;&#x7684;&#x5730;&#x6B65;&#xFF0C;&#x6700;&#x7EC8;&#x5BFC;&#x81F4;&#x5FC3;&#x667A;&#x4F1A;&#x53D7;&#x5F71;&#x54CD;&#xFF0C;&#x5F71;&#x54CD;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x540E;&#x7EED;&#x53D1;&#x5C55;&#x6D41;&#x7A0B;&#x3002;&#x9047;&#x5230;&#x95EE;&#x9898;&#x4E0D;&#x5E94;&#x8BE5;&#x505C;&#x6B62;&#x4E0D;&#x524D;&#xFF0C;&#x5E94;&#x5F53;&#x8FCE;&#x96BE;&#x76F4;&#x4E0A;&#xFF0C;&#x4E0D;&#x5E94;&#x6000;&#x7591;&#x81EA;&#x5DF1;&#x7684;&#x80FD;&#x529B;&#x3002;</p>
<p><strong>&#x6709;&#x6548;&#x7684;&#x65E7;&#x89C2;&#x5FF5;</strong>&#xFF1A;&#x91CF;&#x53D8;&#x4EA7;&#x751F;&#x8D28;&#x53D8;&#xFF0C;&#x4F46;&#x662F;&#x5BB9;&#x6613;&#x5FFD;&#x7565;&#x4E00;&#x70B9;&#xFF0C;&#x5E94;&#x8BE5;&#x662F;&#x6709;&#x6548;&#x7684;&#x91CF;&#x53D8;&#x4EA7;&#x751F;&#x6709;&#x6548;&#x7684;&#x8D28;&#x53D8;&#xFF0C;&#x4E0D;&#x5E94;&#x4ECE;&#x91CF;&#x4E0A;&#x6765;&#x4E0A;&#x5347;&#x5230;&#x8D28;&#x7684;&#x4E0A;&#x9762;&#x3002;</p>
<p><strong>&#x53D8;&#x5316;&#x7684;&#x4E16;&#x754C;</strong>&#xFF1A;&#x4E16;&#x754C;&#x662F;&#x53D8;&#x5316;&#x7684;&#xFF0C;&#x73AF;&#x5883;&#x662F;&#x53D8;&#x5316;&#x7684;&#xFF0C;&#x540C;&#x65F6;&#xFF0C;&#x4F5C;&#x4E3A;&#x4EBA;&#x6211;&#x4EEC;&#x4E5F;&#x662F;&#x53D8;&#x5316;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x53D8;&#x5316;&#x7684;&#x73AF;&#x5883;&#x548C;&#x53D8;&#x5316;&#x7684;&#x8EAB;&#x8FB9;&#x4EBA;&#x5171;&#x540C;&#x6784;&#x9020;&#x6210;&#x73B0;&#x4ECA;&#x7684;&#x6211;&#x4EEC;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E0D;&#x540C;&#x4E8E;&#x81EA;&#x8EAB;&#x60C5;&#x51B5;&#x7684;&#x4EBA;&#x5E94;&#x5F53;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x5E94;&#x5BF9;&#x65B9;&#x6848;&#x3002;</p>
<p>&#x540C;&#x65F6;&#xFF0C;&#x5BF9;&#x4E8E;&#x5EFA;&#x8BBE;&#x6027;&#x7684;&#x5EFA;&#x8BAE;&#x5E94;&#x5F53;&#x5C11;&#x63D0;&#xFF0C;&#x5728;&#x672A;&#x771F;&#x5B9E;&#x7684;&#x4E86;&#x89E3;&#x5230;&#x5F53;&#x4E8B;&#x4EBA;&#x6240;&#x5904;&#x7684;&#x60C5;&#x666F;&#x65F6;&#xFF0C;&#x8981;&#x61C2;&#x5F97;&#x201C;&#x95ED;&#x5634;&#x201D;&#x3002;&#x4E8B;&#x7269;&#x7684;&#x53D1;&#x5C55;&#x90FD;&#x662F;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x89C4;&#x5F8B;&#x6027;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x901A;&#x8FC7;&#x4E2A;&#x4EBA;&#x7684;&#x5E72;&#x6270;&#x53BB;&#x6253;&#x4E71;&#x73AF;&#x5883;&#x7684;&#x4F5C;&#x7528;&#xFF08;&#x540C;&#x65F6;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x4E5F;&#x662F;&#x505A;&#x4E0D;&#x5230;&#x7684;&#xFF09;&#x3002;&#x4E5F;&#x8BB8;&#x5BF9;&#x4E8E;&#x601D;&#x3001;&#x613F;&#x3001;&#x529B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x90FD;&#x5F3A;&#x7684;&#x4EBA;&#x624D;&#x80FD;&#x771F;&#x6B63;&#x7684;&#x505A;&#x5230;&#x6253;&#x7834;&#x73AF;&#x5883;&#x7684;&#x684E;&#x688F;&#xFF0C;&#x6700;&#x7EC8;&#x5F97;&#x4EE5;&#x8131;&#x9896;&#x800C;&#x51FA;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x4FBF;&#x662F;&#x8003;&#x8651;&#x4EF7;&#x503C;&#x7684;&#x672C;&#x8EAB;&#xFF0C;&#x662F;&#x5426;&#x662F;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x4E8B;&#x60C5;&#xFF1F;&#x662F;&#x5426;&#x662F;&#x6709;&#x56DE;&#x62A5;&#x7684;&#x4E8B;&#x60C5;&#xFF1F;&#x4E0D;&#x505A;&#x8FD9;&#x4EF6;&#x4E8B;&#x4F1A;&#x5BF9;&#x6211;&#x672C;&#x8EAB;&#x6709;&#x4EC0;&#x4E48;&#x5F71;&#x54CD;&#xFF1F;&#x8FD9;&#x5C31;&#x662F;&#x6295;&#x8D44;&#x548C;&#x56DE;&#x62A5;&#x7684;&#x76F8;&#x5173;&#x6027;&#x3002;</p>
<h2 id="p2-&#x6267;&#x884C;&#x529B;">P2 &#x6267;&#x884C;&#x529B;</h2>
<p><img src="../images/wallhaven-3l8l1d.jpg" alt=""></p>
<p>&#x672C;&#x4EBA;&#x662F;&#x4E00;&#x4E2A;&#x5584;&#x4E8E;&#x89C2;&#x5BDF;&#x7684;&#x4EBA;&#xFF0C;&#x4F1A;&#x8FDB;&#x884C;&#x5F52;&#x7C7B;&#x8EAB;&#x8FB9;&#x4EBA;&#x6210;&#x529F;&#x7684;&#x89C4;&#x5F8B;&#x3002;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x70B9;&#x53EF;&#x80FD;&#x662F;&#x6267;&#x884C;&#x529B;&#xFF0C;&#x90A3;&#x4E48;&#x7A76;&#x7ADF;&#x4EC0;&#x4E48;&#x662F;&#x6267;&#x884C;&#x529B;&#xFF1F;</p>
<p>&#x6267;&#x884C;&#x529B;&#xFF0C;&#x6307;&#x7684;&#x662F;<strong>&#x8D2F;&#x5F7B;&#x6218;&#x7565;&#x610F;&#x56FE;&#xFF0C;&#x5B8C;&#x6210;&#x9884;&#x5B9A;&#x76EE;&#x6807;&#x7684;&#x64CD;&#x4F5C;&#x80FD;&#x529B;</strong>&#x3002; &#x662F;&#x628A;&#x4F01;&#x4E1A;&#x6218;&#x7565;&#x3001;&#x89C4;&#x5212;&#x8F6C;&#x5316;&#x6210;&#x4E3A;&#x6548;&#x76CA;&#x3001;&#x6210;&#x679C;&#x7684;&#x5173;&#x952E;&#x3002; &#x6267;&#x884C;&#x529B;&#x5305;&#x542B;&#x5B8C;&#x6210;<strong>&#x4EFB;&#x52A1;&#x7684;&#x610F;&#x613F;</strong>&#xFF0C;<strong>&#x5B8C;&#x6210;&#x4EFB;&#x52A1;&#x7684;&#x80FD;&#x529B;</strong>&#xFF0C;<strong>&#x5B8C;&#x6210;&#x4EFB;&#x52A1;&#x7684;&#x7A0B;&#x5EA6;</strong>&#x3002; </p>
<p>&#x7A76;&#x5176;&#x4E09;&#x70B9;&#x5C31;&#x662F;&#x610F;&#x613F;&#x3001;&#x80FD;&#x529B;&#x548C;&#x5B8C;&#x6210;&#x7A0B;&#x5EA6;&#x3002;</p>
<p>&#x610F;&#x613F;&#xFF1A;&#x5927;&#x62B5;&#x662F;&#x6307;&#x613F;&#x529B;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FD9;&#x4EF6;&#x4E8B;&#x4F1A;&#x6295;&#x5165;&#x591A;&#x5927;&#x7684;&#x7CBE;&#x529B;&#xFF0C;&#x4EE5;&#x53CA;&#x4E8B;&#x4EF6;&#x7684;&#x91CD;&#x8981;&#x6027;&#xFF0C;&#x8FD9;&#x91CC;&#x4E3B;&#x8981;&#x662F;&#x56E0;&#x4E3A;&#x5927;&#x90E8;&#x5206;&#x4EBA;&#x53EF;&#x80FD;&#x4F1A;&#x89C9;&#x5F97;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#x5177;&#x6709;&#x4E0D;&#x5FC5;&#x8981;&#x6027;&#x6216;&#x8005;&#x662F;&#x901A;&#x8FC7;&#x81EA;&#x6211;&#x9EBB;&#x75F9;&#x6765;&#x4F7F;&#x81EA;&#x5DF1;&#x611F;&#x89C9;&#x5230;&#x4E8B;&#x60C5;&#x7684;&#x6536;&#x76CA;&#x4F4E;&#x5FAE;&#xFF0C;&#x6700;&#x7EC8;&#x613F;&#x529B;&#x4E0B;&#x964D;&#x540E;&#x5C31;&#x4F1A;&#x4F7F;&#x5F97;&#x4EFB;&#x52A1;&#x6162;&#x6162;&#x7684;&#x62D6;&#x57AE;&#xFF0C;&#x6240;&#x4EE5;&#x505A;&#x4E8B;&#x5E94;&#x4FDD;&#x6301;&#x9AD8;&#x5EA6;&#x7684;&#x7CBE;&#x795E;&#x529B;&#xFF0C;&#x4E13;&#x6CE8;&#x4E8E;&#x4E00;&#x4EF6;&#x4E8B;&#x3002;&#x5BF9;&#x4E8E;&#x5927;&#x4E8B;&#x66F4;&#x5E94;&#x5F53;&#x5C1D;&#x8BD5;&#x5206;&#x89E3;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x754F;&#x96BE;&#x3002;</p>
<p>&#x80FD;&#x529B;&#xFF1A;&#x80FD;&#x529B;&#x4E3B;&#x8981;&#x548C;&#x4E2A;&#x4EBA;&#x5929;&#x8D4B;&#xFF0C;&#x4EE5;&#x53CA;&#x4E0A;&#x8FF0;&#x6240;&#x63D0;&#x7684;&#x610F;&#x613F;&#x6709;&#x5173;&#xFF0C;&#x7EB5;&#x89C2;&#x6240;&#x6709;&#x4EBA;&#xFF0C;&#x5929;&#x624D;&#x5E94;&#x5F53;&#x53EA;&#x662F;&#x5BE5;&#x5BE5;&#x65E0;&#x51E0;&#x7684;&#x5C11;&#x6570;&#x4EBA;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x4EBA;&#x90FD;&#x662F;&#x666E;&#x901A;&#x4EBA;&#xFF0C;&#x5E76;&#x4E0D;&#x5B58;&#x5728;&#x80FD;&#x529B;&#x4E0D;&#x8DB3;&#x7684;&#x60C5;&#x51B5;&#xFF0C;<strong>&#x9664;&#x975E;&#x662F;&#x548C;&#x7269;&#x8D28;&#x6302;&#x94A9;&#x7684;&#x60C5;&#x51B5;</strong>&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x53EF;&#x80FD;&#x662F;&#x5927;&#x591A;&#x6570;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x4E8E;&#x662F;&#x5C31;&#x9700;&#x8981;&#x8003;&#x8651;&#x6027;&#x4EF7;&#x6BD4;&#x3002;</p>
<p>&#x5B8C;&#x6210;&#x7A0B;&#x5EA6;&#xFF1A;&#x8FD9;&#x4E2A;&#x7684;&#x8BDD;&#x662F;&#x6267;&#x884C;&#x529B;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x505A;&#x4E8B;&#x4E00;&#x5B9A;&#x8981;&#x5148;&#x628A;&#x63E1;&#x8D77;&#x70B9;&#x548C;&#x91CD;&#x70B9;&#xFF0C;&#x53EA;&#x6709;&#x8D2F;&#x5F7B;&#x59CB;&#x7EC8;&#xFF0C;&#x4EE5;&#x7EC8;&#x4E3A;&#x59CB;&#x624D;&#x80FD;&#x628A;&#x63E1;&#x5230;&#x4EFB;&#x52A1;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#xFF0C;&#x8FDB;&#x800C;&#x9AD8;&#x8D28;&#x91CF;&#x4E14;&#x6700;&#x5927;&#x7A0B;&#x5EA6;&#x7684;&#x5B8C;&#x6210;&#x4EFB;&#x52A1;&#x3002;</p>
<h2 id="p3-&#x8FD1;&#x671F;&#x72B6;&#x51B5;">P3 &#x8FD1;&#x671F;&#x72B6;&#x51B5;</h2>
<p>&#x65E0;&#x8DA3;&#x3001;&#x65E0;&#x804A;&#x4E14;&#x5BF9;&#x4EFB;&#x4F55;&#x4E8B;&#x90FD;&#x611F;&#x89C9;&#x65E0;&#x8DA3;&#xFF0C;&#x5E0C;&#x671B;&#x53BB;&#x505A;&#x4E00;&#x4E9B;&#x6709;&#x610F;&#x4E49;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E00;&#x76F4;&#x5728;&#x788C;&#x788C;&#x65E0;&#x4E3A;&#x7684;&#x5EA6;&#x65E5;&#xFF01;&#xFF01;&#xFF01;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="2024-04-01-我也是乘上了金三的尾巴.html" class="navigation navigation-prev " aria-label="Previous page: 2024-04-01-我也是乘上了金三的尾巴">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="2024-05-14-选择的差异性.html" class="navigation navigation-next " aria-label="Next page: 2024-05-14-选择的差异性">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"2024-04-26-我和我的惰性思维","level":"1.5","depth":1,"next":{"title":"2024-05-14-选择的差异性","level":"1.6","depth":1,"path":"2024/2024-05-14-选择的差异性.md","ref":"2024/2024-05-14-选择的差异性.md","articles":[]},"previous":{"title":"2024-04-01-我也是乘上了金三的尾巴","level":"1.4","depth":1,"path":"2024/2024-04-01-我也是乘上了金三的尾巴.md","ref":"2024/2024-04-01-我也是乘上了金三的尾巴.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"2024/2024-04-26-我和我的惰性思维.md","mtime":"2024-08-03T15:46:36.270Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2024-08-03T15:48:05.365Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

